<template lang="pug">
    .content-wrapper
        section.general-position
            .title Общее положение
            .content
                .main Настоящая Политика конфиденциальности (далее – Политика) составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных.
                ol.list
                    li.part-list Разработчик LEDOKOL (далее – Оператор) ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.
                    li.part-list Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о пользователях приложения "MathPlace - учите математику и готовьтесь к ОГЭ 2020".
        section.general-position
            .title Основные понятия, используемые в Политике
            .content
                ol.list
                    li.part-list Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники;
                    li.part-list Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);
        section.general-position
            .title Сбор персональных данных пользователей
            .content
                .main Каждый Пользователь может использовать Приложение, не раскрывая при этом своё имя или любые персональные данные; таким образом, все Пользователи, которые используют Приложение, могут оставаться анонимными, пока они не решат авторизоваться в Приложении. Для более комфортного использования Приложения при установке Приложения на мобильное устройство от Пользователей могут запрашиваться:
        section.general-position
            .title Цели обработки персональных данных
            .content
                .main Настоящая Политика конфиденциальности (далее – Политика) составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных.
                ol.list
                    li.part-list Разработчик LEDOKOL (далее – Оператор) ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.
                    li.part-list Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о пользователях приложения "MathPlace - учите математику и готовьтесь к ОГЭ 2020".
        section.general-position
            .title Правовые основания обработки персональных данных
            .content
                .main Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные в Приложении. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.
        section.general-position
            .title Порядок сбора, хранения, передачи и других видов обработки персональных данных
            .content
                .main Настоящая Политика конфиденциальности (далее – Политика) составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных.
                ol.list
                    li.part-list Разработчик LEDOKOL (далее – Оператор) ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.
                    li.part-list Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о пользователях приложения "MathPlace - учите математику и готовьтесь к ОГЭ 2020".
        section.general-position
            .title Распространение и раскрытие информации
            .content
                .main Оператор не продает, не предоставляет на условиях аренды и не делится личной информацией Пользователей с третьими сторонами, за исключением деловых партнеров Оператора, в частности, Фондов и платежных систем, с целью повышения качества услуг. Оператор взаимодействует с правительством и представителями органов исполнительной власти с целью выполнения и соблюдения законодательства. Оператор может раскрывать персональные данные, добросовестно полагая, что он уполномочен это делать, или что такое поведение является оправданно необходимым или обоснованным для соблюдения законодательства, или судебного процесса, или требований органов государственной власти; в ответ на любые жалобы, или для защиты прав, собственности или безопасности Оператора, его клиентов, сотрудников или общества, в том числе, но не ограничиваясь, от мошенничества, злоупотребления, неправильного или незаконного использования Приложения. Оператор может раскрыть на официальный запрос органов государственной власти информацию, необходимую для расследования, например, имя Пользователя, адрес, телефон, e-mail, дату рождения и т. п. Оператор может раскрыть персональные данные Пользователя на запрос другого Пользователя, если такой Пользователь не сможет получить возмещение стоимости Консультации в соответствии с Условиями пользования, с целью предоставить Пользователю возможность обращения в суд. Оператор предоставляет обладателям авторских прав всю необходимую информацию для контроля использования их интеллектуальной собственности в сети Интернет.
        section.general-position
            .title Информационная безопасность
            .content
                .main Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.
                .main Приложение оснащено мерами обеспечения безопасности и защиты личной информации и персональных данных Пользователей от их утери, злоупотребления, несанкционированного доступа, использования, раскрытия, внесения изменений или уничтожения. Оператор обращает внимание на то, что ни один из существующих способов передачи данных не может быть абсолютно безопасным. Поэтому Оператор, не смотря на все принятые меры по обеспечению безопасности, не может гарантировать полную сохранность информации и данных. Оператор не несет ответственности за незаконные действия третьих лиц, хакеров, злоумышленников и прочих нарушителей применяемого законодательства, которые могут нарушать условия настоящей Политики конфиденциальности и пытаться завладеть полностью или частично личной информацией и персональными данными Пользователей, а также использовать её в личных целях. При работе с Приложением Пользователю не предоставляются права интеллектуальной собственности ни на само Приложение (кроме лицензии, указанной в Условиях пользования), ни на связанный с ним контент. Указанный контент Приложения может быть использован Пользователем только в том случае, если он получил разрешение его владельца или если такая возможность обеспечивается законодательством. Настоящая Политика конфиденциальности не предоставляет Пользователям прав на использование каких-либо различительных элементов Приложения. Пользователь не должен удалять, скрывать или изменять юридические уведомления, отображаемые в Приложении. Отдельные функции Приложения позволяют Пользователям загружать, добавлять, хранить, отправлять или получать контент. При этом все права на интеллектуальную собственность в отношении таких материалов остаются у их владельца. Системы Приложения автоматически анализируют контент Пользователя с целью предоставления полезной для Пользователя информации. Кроме того, такой анализ помогает выявлять спам и вредоносные программы. Он выполняется во время отправки, получения и хранения контента.
        section.general-position
            .title Ссылки на внешние сайты
            .content
                .main Приложение может содержать ссылки на посторонние сайты. Оператор не несет ответственности за содержание и деятельность таких сайтов и обеспечение ими конфиденциальности, и за любой ущерб, связанный и возникающий вследствие посещения Пользователями таких сайтов. Передача информации личного характера при посещении внешних сайтов, даже если они содержат ссылки на Сайт Оператора или веб-страницу Приложения на AppStore или GooglePlay, не попадает под условия настоящей Политики конфиденциальности. Оператор не несет ответственности за действия сторонних сайтов. Сбор и передача личной информации и персональных данных Пользователями регламентируются документами об использовании подобной информации, размещенными на внешних сайтах.
        section.general-position
            .title Запросы и жалобы пользователей по поводу Политики конфиденциальности
            .content
                .main В тех случаях, когда, по мнению Пользователя, нарушены условия настоящей Политики конфиденциальности в отношении персональных данных, или при наличии вопросов, относящихся к конфиденциальности, необходимо воспользоваться функцией обратной связи и направить Оператору на указанный на Сайте или на веб-странице Приложения AppStore или GooglePlay соответствующий запрос. Оператор проверяет все сообщения о предполагаемых нарушениях прав и, руководствуясь применяемым законодательством и Условиями пользования, прекращает действие аккаунтов, владельцы которых систематически нарушают законодательство или осуществляют другие действия, запрещённые Условиями пользования.
        section.general-position
            .title Дополнения Политики конфиденциальности
            .content
                .main Оператор оставляет за собой право обновлять, редактировать и вносить изменения в настоящую Политику конфиденциальности без дополнительного уведомления Пользователей. Датой вступления в силу изменений является дата публикации на Сайте или на веб-странице Приложения на сайте AppStore или GooglePlay обновленной версии Политики конфиденциальности.
        section.general-position
            .title Заключительные положения
            .content
                ol.list
                    li.part-list Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты ledokolfd@gmail.com.
                    li.part-list В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.
                    li.part-list Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу mathplace.ru/privacy/.
</template>

<script>

export default {
  data () {
    return {
      state: 0,
      answer: ''
    }
  },
  methods: {
    sendAnswer () {
      if (this.answer === '10') this.state = 1
      else this.state = 2
    }
  }
}

</script>

<style lang="stylus" scoped>

    .content-wrapper
        text-align center
        margin-left 10%
        margin-right 10%

    .content
        font-family 'Roboto', sans-serif
        font-size 1.5em
        line-height 1.3

    .title
        color #763DCA
        font-family 'Roboto', sans-serif
        font-size 2em
        font-weight bold
        margin-bottom 3%

</style>
